---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHandleNameData.GetCustomHandleTag
source: html/028dbe8c-b0f2-c1da-d5c1-93de6ad840c7.htm
---
# Autodesk.Revit.DB.Structure.RebarHandleNameData.GetCustomHandleTag Method

Gets the handle tag for which we need to specify the name.

## Syntax (C#)
```csharp
public int GetCustomHandleTag()
```

## Returns
Returns the handle tag for which we need to specify the name.